# Trabajo hecho en clase

In [9]:
import numpy as np
import pandas as pd
import requests
import matplotlib.pyplot as plt
import os

In [10]:
url = 'https://www.indexmundi.com/map/?t=0&v=25&r=xx&1=en'
html = requests.get(url).content
Birth_rate = pd.read_html(html)[2]

In [49]:
Birth_rate.tail()

         Country  Birth rate (births/1,000 population)  Year
192     Slovenia                                     8  2017
193  Puerto Rico                                     8  2017
194        Japan                                     8  2017
195      Andorra                                     8  2017
196       Monaco                                     7  2017

In [18]:
url = 'https://www.indexmundi.com/map/?t=0&v=25&r=xx&1=en'
html = requests.get(url).content
VIH = pd.read_html(html)[2]

In [19]:
VIH.head()

  Country  Birth rate (births/1,000 population)  Year
0  Angola                                    44  2017
1   Niger                                    44  2017
2    Mali                                    44  2017
3  Uganda                                    43  2017
4  Zambia                                    42  2017

In [45]:
url = 'https://www.indexmundi.com/map/?t=0&v=74&r=xx&l=en'
html = requests.get(url).content
unemployement = pd.read_html(html)[2]

In [47]:
unemployement.tail()

      Country  Unemployment rate (%)  Year
180     Benin                      1  2014
181   Belarus                      1  2017
182  Thailand                      1  2017
183     Qatar                      1  2017
184  Cambodia                      0  2017

In [25]:
Birth_rate['Birth rate (births/1,000 population)']

0      44
1      44
2      44
3      43
4      42
       ..
192     8
193     8
194     8
195     8
196     7
Name: Birth rate (births/1,000 population), Length: 197, dtype: int64

In [26]:
Birth_rate['Year']

Country
Angola         2017
Niger          2017
Mali           2017
Uganda         2017
Zambia         2017
               ...
Slovenia       2017
Puerto Rico    2017
Japan          2017
Andorra        2017
Monaco         2017
Name: Year, Length: 197, dtype: int64

In [34]:
Birth_rate[0:2]

  Country  Birth rate (births/1,000 population)  Year
0  Angola                                    44  2017
1   Niger                                    44  2017

In [40]:
births = pd.Series(Birth_rate['Birth rate (births/1,000 population)'])
births.index = [Birth_rate.Country]

In [41]:
births

Country
Angola         44
Niger          44
Mali           44
Uganda         43
Zambia         42
               ..
Slovenia        8
Puerto Rico     8
Japan           8
Andorra         8
Monaco          7
Name: Birth rate (births/1,000 population), Length: 197, dtype: int64

In [44]:
pd.DataFrame(Birth_rate)[0:5]

  Country  Birth rate (births/1,000 population)  Year
0  Angola                                    44  2017
1   Niger                                    44  2017
2    Mali                                    44  2017
3  Uganda                                    43  2017
4  Zambia                                    42  2017

## Bases de datos

In [56]:
tabulador = pd.read_excel('tabulador_pe2019.xls', header = 9) #Los datos comienzan desde el renglon10

In [60]:
tabulador[0:5]

,NIVEL,TIPO,PUESTO,SUELDO BASE,CUOTAS SEGURIDAD SOCIAL,PREVISIÓN SOCIAL,AYUDA X SERVICIOS,APOYO FAMILIAR,GRATIFICACIÓN QUINCENAL,SUELDO MENSUAL BRUTO,IMPTO MENSUAL,ISSEG,ISSSTE,SUELDO MENSUAL NETO,PRIMA VACACIONAL,AGUINALDO
0,22,NaN,GOBERNADOR/A DEL ESTADO,59804.327930,5843.07,1913.1,25897,64294.837780,75373.99,233126.325711,69584.321342,5082.66,760.41,157698.934369,10 Días por Año,45 Días por Año
1,20,NaN,SECRETARIO/A DE ESTADO A,49025.945517,5843.07,1913.1,22783,48858.839699,67187.62,195611.575216,56829.306173,5082.66,760.41,132939.199042,10 Días por Año,45 Días por Año
2,19,NaN,DIRECTOR/A GENERAL PARAESTATAL A,40685.951590,5843.07,1913.1,18805,41397.705456,49230.82,157875.647046,43999.090596,5082.66,760.41,108033.486450,10 Días por Año,45 Días por Año
3,19,NaN,SECRETARIO/A DE ESTADO B,40685.951590,5843.07,1913.1,18805,41397.705456,49230.82,157875.647046,43999.090596,5082.66,760.41,108033.486450,10 Días por Año,45 Días por Año
4,18,NaN,SECRETARIO/A DE ESTADO C,37083.708634,5843.07,1913.1,16756,35924.238404,42651.90,140172.017038,37979.856393,5082.66,760.41,96349.090645,10 Días por Año,45 Días por Año

Preguntas a responder:
- ¿Cuál es la suma de todos los sueldos base?
- ¿Cuál es la suma del sueldo base y el apoyo familiar en cada puesto?
- ¿Cuál es la suma de todos los sueldo base con apoyo familiar?
- ¿Cuál es el promedio del sueldo base?
- ¿Cuál es el promedio del apoyo familiar?
- ¿Qué porcentaje de los puestos tiene un sueldo base mayor a 30000 pesos mensuales?
- ¿Qué porcentaje de los puestos tiene un sueldo menor a 20000 pesos mensuales?
- ¿Qué porcentaje de los puestos tiene un apoyo familiar mayor a 50000 pesos?
- ¿Qué porcentaje de los puestos tiene un apoyo familiar menor a 20000 pesos?
- ¿Cuál es el promedio de cuotas seguridad social?
- ¿Cuál es el promedio de la ayuda por servicios?
- ¿Cuál es el promedio de la gratificación quincenal?
- ¿Cuánto es la suma del sueldo base, el apoyo familia y la gratificación quincenal de casa puesto?
- ¿Cuál es la suma de todos los sueldos base mas el apoyo a la familia y mas la gratificación quincenal?
- ¿Cuál es la suma de todas ĺas gratificaciones quincenales?
- ¿Cuál es el promedio del sueldo mensual bruto?
- ¿El sueldo mensual bruto es igual a la suma de sueldo base, apoyo familiar y gratificación quincenal?
- ¿Cuál es la resta entre el sueldo mensual bruto y la suma del sueldo base, el apoyo familiar y la gratificación quincenal?
- ¿Cuál es la resta entre el sueldo mensual neto y el sueldo mensual bruto?
- ¿Cuántos son los días por año que se repiten más en la prima vacacional?
- ¿Cuántas veces se repite 45 dias por año en aguinaldo?
- ¿Cuál es el promedio de días por año del aguinaldo?
- ¿Cuánto se paga de aguinaldo en cada puesto?
- ¿Cuánto se paga de prima vacacional en cada puesto?
- ¿Cuál es el promedio de Impto mensual? 
- ¿Cuál es la suma de todos los gastos en ISSEG?
- ¿Cuál es la suma de todos los gatos en ISSSTE?
- ¿Cuál es la diferencia (en cada puesto) de gastos en ISSEG e ISSSTE?
- ¿Cuál es la diferencia del pago de prima vacacional y aguinaldo en cada puesto?
- ¿Cuál es el promedio del pago de prima vacacional?
- ¿Cuál es el sueldo base máximo?
- ¿Cuál es el sueldo base mínimo?
- ¿Cuál es el apoyo familiar máximo?
- ¿Cuál es el apoyo familiar mínimo?
- ¿Cuál es el máximo y mínimo de la gratificación quincenal?
- ¿Cuál es el máximo y mínimo del sueldo mensual bruto?
- ¿Cuál es el máximo y mínimo del apoyo familiar?

### Segunda base de datos con temp mínima, media y máxima

Preguntas a responder 
- ¿Qué nombres de ciudades tienen datos en todas las columnas?
- ¿Qué ciudades tienen datos en todas las temperaturas?
- ¿Qué ciudades no tienen datos de precipitación en lluvias?
- ¿Qué ciudades no tienen datos de ninguna temperatura?
- ¿Qué ciudades tienen al menos una de las temperaturas?
- ¿Cuál es el promedio de temperatura mínima en el año 2018?
- ¿Cuál es el promedio de temperatura mínima en el año 2019?
- ¿Cuál es el promedio de temperatura media en el año 2018?
- ¿Cuál es el promedio de temperatura media en el año 2019?
- ¿Cuál es el promedio de temperatura máxima en el año 2018?
- ¿Cuál es el promedio de temperatura máxima en el año 2018?
- ¿El promedio de temperatura mínima en 2018 es menor que el promedio en 2019?
- ¿El promedio de temperatura media en 2018 es mayor que el promedio en 2019?
- ¿El promeio de temperatura máxima en 2018 es menor que el promedio en 2019?
- ¿Cuál es la diferencia de cada ciudad entre temperatura mínima en 2018 y temperatura mínima en 2019?
- ¿Cuál es la diferencia de cada ciudad entre temperatura media en 2018 y temperatura media en 2019?
- ¿Cuál es la diferencia de cada ciudad entre temperatura máxima en 2018 y temperatura máxima en 2019?
- ¿Cuál es la diferencia entre temperatura mínima y media del 2018?
- ¿Cuál es la diferencia entre temperatura mínina y máxima del 2018?
- ¿Cuál es la diferencia entre temperatura máxima y media del 2018?
- ¿Cuál es la diferencia entre temperatura mínima y media del 2019?
- ¿Cuál es la diferencia entre temperatura mínina y máxima del 2019?
- ¿Cuál es la diferencia entre temperatura máxima y media del 2019?
- ¿Cuál es la diferencia en precipitación del 2018 y del 2019?
- ¿Cuál es el promedio de precipitación del 2018?
- ¿Cuál es el promedio de precipitación del 2019?
- ¿Qué ciudades tienen temperatura máxima del 2018 mayor que 35° C?
- ¿Qué ciudades tienen temperatura mínima del 2018 menor que 10° C?
- ¿Qué ciudades tienen temperatura máxima del 2019 mayor que 35° C?
- ¿Qué ciudades tienen temperatura mínima del 2019 menor que 10° C?
- ¿Qué ciudades tienen temperatura máxima del 2018 mayor que 35° C y precipitación menor a 40° C?